Revit 2026 API

# CeramicCeramicBump Property

---

The property labeled "Type" from the "Ceramic" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CeramicBump { get; }
```
```vb
Public Shared ReadOnly Property CeramicBump As String
	Get
```
```cpp
public:
static property String^ CeramicBump {
	String^ get ();
}
```
```fsharp
static member CeramicBump : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "CeramicBumpType".

#### Reference

Ceramic Class

Autodesk.Revit.DB.Visual Namespace